In [1]:
pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [5]:
#Import Python Libraries

In [8]:
#Import Python Libraries
import numpy as np
import pandas as pd
import matplotlib as mpl
import seaborn as sns

In [80]:
df = pd.read_csv("/content/Salaries.csv")

In [11]:
df .head(5)

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      Prof          B             19           18  Male  139750
1           2      Prof          B             20           16  Male  173200
2           3  AsstProf          B              4            3  Male   79750
3           4      Prof          B             45           39  Male  115000
4           5      Prof          B             40           41  Male  141500

In [13]:
df.head(10)

   Unnamed: 0       rank discipline  yrs.since.phd  yrs.service     sex  salary
0           1       Prof          B             19           18    Male  139750
1           2       Prof          B             20           16    Male  173200
2           3   AsstProf          B              4            3    Male   79750
3           4       Prof          B             45           39    Male  115000
4           5       Prof          B             40           41    Male  141500
5           6  AssocProf          B              6            6    Male   97000
6           7       Prof          B             30           23    Male  175000
7           8       Prof          B             45           45    Male  147765
8           9       Prof          B             21           20    Male  119250
9          10       Prof          B             18           18  Female  129000

In [17]:
df.head (50)

    Unnamed: 0       rank discipline  ...  yrs.service     sex  salary
0            1       Prof          B  ...           18    Male  139750
1            2       Prof          B  ...           16    Male  173200
2            3   AsstProf          B  ...            3    Male   79750
3            4       Prof          B  ...           39    Male  115000
4            5       Prof          B  ...           41    Male  141500
5            6  AssocProf          B  ...            6    Male   97000
6            7       Prof          B  ...           23    Male  175000
7            8       Prof          B  ...           45    Male  147765
8            9       Prof          B  ...           20    Male  119250
9           10       Prof          B  ...           18  Female  129000
10          11  AssocProf          B  ...            8    Male  119800
11          12   AsstProf          B  ...            2    Male   79800
12          13   AsstProf          B  ...            1    Male   77700
13          14   AsstProf          B  ...            0    Male   78000
14          15       Prof          B  ...           18    Male  104800
15          16       Prof          B  ...            3    Male  117150
16          17       Prof          B  ...           20    Male  101000
17          18       Prof          A  ...           34    Male  103450
18          19       Prof          A  ...           23    Male  124750
19          20       Prof          A  ...           36  Female  137000
20          21       Prof          A  ...           26    Male   89565
21          22       Prof          A  ...           31    Male  102580
22          23       Prof          A  ...           30    Male   93904
23          24       Prof          A  ...           19    Male  113068
24          25  AssocProf          A  ...            8  Female   74830
25          26       Prof          A  ...            8    Male  106294
26          27       Prof          A  ...           23    Male  134885
27          28   AsstProf          B  ...            3    Male   82379
28          29   AsstProf          B  ...            0    Male   77000
29          30       Prof          B  ...            8    Male  118223
30          31       Prof          B  ...            4    Male  132261
31          32   AsstProf          B  ...            2    Male   79916
32          33       Prof          B  ...            9    Male  117256
33          34   AsstProf          B  ...            2    Male   80225
34          35   AsstProf          B  ...            2  Female   80225
35          36   AsstProf          B  ...            0  Female   77000
36          37       Prof          B  ...           21    Male  155750
37          38   AsstProf          B  ...            4    Male   86373
38          39       Prof          B  ...           31    Male  125196
39          40  AssocProf          B  ...            9    Male  100938
40          41       Prof          B  ...            2    Male  146500
41          42  AssocProf          B  ...           23    Male   93418
42          43       Prof          B  ...           27    Male  101299
43          44       Prof          B  ...           38    Male  231545
44          45       Prof          B  ...           19    Male   94384
45          46       Prof          B  ...           15    Male  114778
46          47       Prof          B  ...           28    Male   98193
47          48       Prof          B  ...           19  Female  151768
48          49       Prof          B  ...           25  Female  140096
49          50   AsstProf          B  ...            1    Male   70768

[50 rows x 7 columns]

In [20]:
df.dtypes

Unnamed: 0        int64
rank             object
discipline       object
yrs.since.phd     int64
yrs.service       int64
sex              object
salary            int64
dtype: object

In [22]:
df.columns

Index(['Unnamed: 0', 'rank', 'discipline', 'yrs.since.phd', 'yrs.service',
       'sex', 'salary'],
      dtype='object')

In [24]:
df.size

2779

In [26]:
df.shape

(397, 7)

In [28]:
df.ndim

2

In [31]:
df.values

array([[1, 'Prof', 'B', ..., 18, 'Male', 139750],
       [2, 'Prof', 'B', ..., 16, 'Male', 173200],
       [3, 'AsstProf', 'B', ..., 3, 'Male', 79750],
       ...,
       [395, 'Prof', 'A', ..., 25, 'Male', 101738],
       [396, 'Prof', 'A', ..., 15, 'Male', 95329],
       [397, 'AsstProf', 'A', ..., 4, 'Male', 81035]], dtype=object)

In [33]:
df.axes

[RangeIndex(start=0, stop=397, step=1),
 Index(['Unnamed: 0', 'rank', 'discipline', 'yrs.since.phd', 'yrs.service',
        'sex', 'salary'],
       dtype='object')]

In [37]:
df.shape

(397, 7)

In [39]:
df.columns

Index(['Unnamed: 0', 'rank', 'discipline', 'yrs.since.phd', 'yrs.service',
       'sex', 'salary'],
      dtype='object')

AttributeError: ignored

In [44]:
df.describe()

       Unnamed: 0  yrs.since.phd  yrs.service         salary
count  397.000000     397.000000   397.000000     397.000000
mean   199.000000      22.314861    17.614610  113706.458438
std    114.748275      12.887003    13.006024   30289.038695
min      1.000000       1.000000     0.000000   57800.000000
25%    100.000000      12.000000     7.000000   91000.000000
50%    199.000000      21.000000    16.000000  107300.000000
75%    298.000000      32.000000    27.000000  134185.000000
max    397.000000      56.000000    60.000000  231545.000000

In [46]:
df.max()

Unnamed: 0          397
rank               Prof
discipline            B
yrs.since.phd        56
yrs.service          60
sex                Male
salary           231545
dtype: object

In [63]:
df.head(50).mean()

yrs.since.phd        20.92
yrs.service          16.22
salary           112625.64
dtype: float64

AttributeError: ignored

In [85]:
df[['yrs.since.phd']].describe()

       yrs.since.phd
count     397.000000
mean       22.314861
std        12.887003
min         1.000000
25%        12.000000
50%        21.000000
75%        32.000000
max        56.000000

In [87]:
df[['yrs.since.phd']].count()

yrs.since.phd    397
dtype: int64

In [89]:
df['yrs.since.phd'].mean()

22.31486146095718

In [94]:
df.groupby(['rank']).mean()

           Unnamed: 0  yrs.since.phd  yrs.service         salary
rank
AssocProf  179.828125      15.453125    11.953125   93876.437500
AsstProf   169.761194       5.104478     2.373134   80775.985075
Prof       210.977444      28.300752    22.815789  126772.109023

In [100]:
df[df['salary']>120000]

     Unnamed: 0  rank discipline  yrs.since.phd  yrs.service   sex  salary
0             1  Prof          B             19           18  Male  139750
1             2  Prof          B             20           16  Male  173200
4             5  Prof          B             40           41  Male  141500
6             7  Prof          B             30           23  Male  175000
7             8  Prof          B             45           45  Male  147765
..          ...   ...        ...            ...          ...   ...     ...
386         387  Prof          A             29           27  Male  139219
389         390  Prof          A             33           18  Male  186023
390         391  Prof          A             40           19  Male  166605
391         392  Prof          A             30           19  Male  151292
393         394  Prof          A             31           19  Male  150564

[142 rows x 7 columns]

In [106]:
df[(df['discipline']=='B') & (df['yrs.since.phd']>=20)]

     Unnamed: 0  rank discipline  yrs.since.phd  yrs.service   sex  salary
1             2  Prof          B             20           16  Male  173200
3             4  Prof          B             45           39  Male  115000
4             5  Prof          B             40           41  Male  141500
6             7  Prof          B             30           23  Male  175000
7             8  Prof          B             45           45  Male  147765
..          ...   ...        ...            ...          ...   ...     ...
350         351  Prof          B             56           49  Male  186960
351         352  Prof          B             38           38  Male   93519
352         353  Prof          B             26           27  Male  142500
353         354  Prof          B             22           20  Male  138000
355         356  Prof          B             25           21  Male  145028

[100 rows x 7 columns]

In [108]:
df.head()

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      Prof          B             19           18  Male  139750
1           2      Prof          B             20           16  Male  173200
2           3  AsstProf          B              4            3  Male   79750
3           4      Prof          B             45           39  Male  115000
4           5      Prof          B             40           41  Male  141500

In [111]:
df.iloc[1:4, 0:3]

   Unnamed: 0      rank discipline
1           2      Prof          B
2           3  AsstProf          B
3           4      Prof          B

In [119]:
df.iloc[0:2,4:]

   yrs.service   sex  salary
0           18  Male  139750
1           16  Male  173200

In [124]:
df.iloc[2:4, 2:5]

  discipline  yrs.since.phd  yrs.service
2          B              4            3
3          B             45           39

In [127]:
df.iloc[1:4,0:3]

   Unnamed: 0      rank discipline
1           2      Prof          B
2           3  AsstProf          B
3           4      Prof          B

In [129]:
tips

NameError: ignored